title: GitHub Test Rule
id: 700f552f-0fa9-4bfe-bbaf-bbbde94c1c8c
status: test
description: Detects a repository being deleted.
author: jamesc-grafana
date: 2025-09-25
logsource:
  product: github
  service: audit
detection:
  selection:
    username:
      - "admin0"
      - "admin1"
      - "admin2"
      - "admin3"
      - "admin4"
      - "admin5"
      - "admin6"
      - "admin7"
      - "admin8"
      - "admin9"
      - "admin10"
      - "admin11"
      - "admin12"
      - "admin13"
      - "admin14"
      - "admin15"
      - "admin16"
      - "admin17"
      - "admin18"
      - "admin19"
      - "admin20"
      - "admin21"
      - "admin22"
      - "admin23"
      - "admin24"
      - "admin25"
      - "admin26"
      - "admin27"
      - "admin28"
      - "admin29"
      - "admin30"
      - "admin31"
      - "admin32"
      - "admin33"
      - "admin34"
      - "admin35"
      - "admin36"
      - "admin37"
      - "admin38"
      - "admin39"
      - "admin40"
      - "admin41"
      - "admin42"
      - "admin43"
      - "admin44"
      - "admin45"
      - "admin46"
      - "admin47"
      - "admin48"
      - "admin49"
      - "admin50"
      - "admin51"
      - "admin52"
      - "admin53"
      - "admin54"
      - "admin55"
      - "admin56"
      - "admin57"
      - "admin58"
      - "admin59"
      - "admin60"
      - "admin61"
      - "admin62"
      - "admin63"
      - "admin64"
      - "admin65"
      - "admin66"
      - "admin67"
      - "admin68"
      - "admin69"
      - "admin70"
      - "admin71"
      - "admin72"
      - "admin73"
      - "admin74"
      - "admin75"
      - "admin76"
      - "admin77"
      - "admin78"
      - "admin79"
      - "admin80"
      - "admin81"
      - "admin82"
      - "admin83"
      - "admin84"
      - "admin85"
      - "admin86"
      - "admin87"
      - "admin88"
      - "admin89"
      - "admin90"
      - "admin91"
      - "admin92"
      - "admin93"
      - "admin94"
      - "admin95"
      - "admin96"
      - "admin97"
      - "admin98"
      - "admin99"
      - "admin100"
      - "admin101"
      - "admin102"
      - "admin103"
      - "admin104"
      - "admin105"
      - "admin106"
      - "admin107"
      - "admin108"
      - "admin109"
      - "admin110"
      - "admin111"
      - "admin112"
      - "admin113"
      - "admin114"
      - "admin115"
      - "admin116"
      - "admin117"
      - "admin118"
      - "admin119"
      - "admin120"
      - "admin121"
      - "admin122"
      - "admin123"
      - "admin124"
      - "admin125"
      - "admin126"
      - "admin127"
      - "admin128"
      - "admin129"
      - "admin130"
      - "admin131"
      - "admin132"
      - "admin133"
      - "admin134"
      - "admin135"
      - "admin136"
      - "admin137"
      - "admin138"
      - "admin139"
      - "admin140"
      - "admin141"
      - "admin142"
      - "admin143"
      - "admin144"
      - "admin145"
      - "admin146"
      - "admin147"
      - "admin148"
      - "admin149"
      - "admin150"
      - "admin151"
      - "admin152"
      - "admin153"
      - "admin154"
      - "admin155"
      - "admin156"
      - "admin157"
      - "admin158"
      - "admin159"
      - "admin160"
      - "admin161"
      - "admin162"
      - "admin163"
      - "admin164"
      - "admin165"
      - "admin166"
      - "admin167"
      - "admin168"
      - "admin169"
      - "admin170"
      - "admin171"
      - "admin172"
      - "admin173"
      - "admin174"
      - "admin175"
      - "admin176"
      - "admin177"
      - "admin178"
      - "admin179"
      - "admin180"
      - "admin181"
      - "admin182"
      - "admin183"
      - "admin184"
      - "admin185"
      - "admin186"
      - "admin187"
      - "admin188"
      - "admin189"
      - "admin190"
      - "admin191"
      - "admin192"
      - "admin193"
      - "admin194"
      - "admin195"
      - "admin196"
      - "admin197"
      - "admin198"
      - "admin199"
      - "admin200"
      - "admin201"
      - "admin202"
      - "admin203"
      - "admin204"
      - "admin205"
      - "admin206"
      - "admin207"
      - "admin208"
      - "admin209"
      - "admin210"
      - "admin211"
      - "admin212"
      - "admin213"
      - "admin214"
      - "admin215"
      - "admin216"
      - "admin217"
      - "admin218"
      - "admin219"
      - "admin220"
      - "admin221"
      - "admin222"
      - "admin223"
      - "admin224"
      - "admin225"
      - "admin226"
      - "admin227"
      - "admin228"
      - "admin229"
      - "admin230"
      - "admin231"
      - "admin232"
      - "admin233"
      - "admin234"
      - "admin235"
      - "admin236"
      - "admin237"
      - "admin238"
      - "admin239"
      - "admin240"
      - "admin241"
      - "admin242"
      - "admin243"
      - "admin244"
      - "admin245"
      - "admin246"
      - "admin247"
      - "admin248"
      - "admin249"
      - "admin250"
      - "admin251"
      - "admin252"
      - "admin253"
      - "admin254"
      - "admin255"
      - "admin256"
      - "admin257"
      - "admin258"
      - "admin259"
      - "admin260"
      - "admin261"
      - "admin262"
      - "admin263"
      - "admin264"
      - "admin265"
      - "admin266"
      - "admin267"
      - "admin268"
      - "admin269"
      - "admin270"
      - "admin271"
      - "admin272"
      - "admin273"
      - "admin274"
      - "admin275"
      - "admin276"
      - "admin277"
      - "admin278"
      - "admin279"
      - "admin280"
      - "admin281"
      - "admin282"
      - "admin283"
      - "admin284"
      - "admin285"
      - "admin286"
      - "admin287"
      - "admin288"
      - "admin289"
      - "admin290"
      - "admin291"
      - "admin292"
      - "admin293"
      - "admin294"
      - "admin295"
      - "admin296"
      - "admin297"
      - "admin298"
      - "admin299"
      - "admin300"
      - "admin301"
      - "admin302"
      - "admin303"
      - "admin304"
      - "admin305"
      - "admin306"
      - "admin307"
      - "admin308"
      - "admin309"
      - "admin310"
      - "admin311"
      - "admin312"
      - "admin313"
      - "admin314"
      - "admin315"
      - "admin316"
      - "admin317"
      - "admin318"
      - "admin319"
      - "admin320"
      - "admin321"
      - "admin322"
      - "admin323"
      - "admin324"
      - "admin325"
      - "admin326"
      - "admin327"
      - "admin328"
      - "admin329"
      - "admin330"
      - "admin331"
      - "admin332"
      - "admin333"
      - "admin334"
      - "admin335"
      - "admin336"
      - "admin337"
      - "admin338"
      - "admin339"
      - "admin340"
      - "admin341"
      - "admin342"
      - "admin343"
      - "admin344"
      - "admin345"
      - "admin346"
      - "admin347"
      - "admin348"
      - "admin349"
      - "admin350"
      - "admin351"
      - "admin352"
      - "admin353"
      - "admin354"
      - "admin355"
      - "admin356"
      - "admin357"
      - "admin358"
      - "admin359"
      - "admin360"
      - "admin361"
      - "admin362"
      - "admin363"
      - "admin364"
      - "admin365"
      - "admin366"
      - "admin367"
      - "admin368"
      - "admin369"
      - "admin370"
      - "admin371"
      - "admin372"
      - "admin373"
      - "admin374"
      - "admin375"
      - "admin376"
      - "admin377"
      - "admin378"
      - "admin379"
      - "admin380"
      - "admin381"
      - "admin382"
      - "admin383"
      - "admin384"
      - "admin385"
      - "admin386"
      - "admin387"
      - "admin388"
      - "admin389"
      - "admin390"
      - "admin391"
      - "admin392"
      - "admin393"
      - "admin394"
      - "admin395"
      - "admin396"
      - "admin397"
      - "admin398"
      - "admin399"
      - "admin400"
      - "admin401"
      - "admin402"
      - "admin403"
      - "admin404"
      - "admin405"
      - "admin406"
      - "admin407"
      - "admin408"
      - "admin409"
      - "admin410"
      - "admin411"
      - "admin412"
      - "admin413"
      - "admin414"
      - "admin415"
      - "admin416"
      - "admin417"
      - "admin418"
      - "admin419"
      - "admin420"
      - "admin421"
      - "admin422"
      - "admin423"
      - "admin424"
      - "admin425"
      - "admin426"
      - "admin427"
      - "admin428"
      - "admin429"
      - "admin430"
      - "admin431"
      - "admin432"
      - "admin433"
      - "admin434"
      - "admin435"
      - "admin436"
      - "admin437"
      - "admin438"
      - "admin439"
      - "admin440"
      - "admin441"
      - "admin442"
      - "admin443"
      - "admin444"
      - "admin445"
      - "admin446"
      - "admin447"
      - "admin448"
      - "admin449"
      - "admin450"
      - "admin451"
      - "admin452"
      - "admin453"
      - "admin454"
      - "admin455"
      - "admin456"
      - "admin457"
      - "admin458"
      - "admin459"
      - "admin460"
      - "admin461"
      - "admin462"
      - "admin463"
      - "admin464"
      - "admin465"
      - "admin466"
      - "admin467"
      - "admin468"
      - "admin469"
      - "admin470"
      - "admin471"
      - "admin472"
      - "admin473"
      - "admin474"
      - "admin475"
      - "admin476"
      - "admin477"
      - "admin478"
      - "admin479"
      - "admin480"
      - "admin481"
      - "admin482"
      - "admin483"
      - "admin484"
      - "admin485"
      - "admin486"
      - "admin487"
      - "admin488"
      - "admin489"
      - "admin490"
      - "admin491"
      - "admin492"
      - "admin493"
      - "admin494"
      - "admin495"
      - "admin496"
      - "admin497"
      - "admin498"
      - "admin499"
      - "admin500"
  condition: selection
falsepositives:
  - Validate the deletion activity is permitted. The "actor" field need to be validated.
level: informational
