title: GitHub Test Rule
id: 700f552f-0fa9-4bfe-bbaf-bbbde94c1c8c
status: test
description: Detects a repository being deleted.
author: jamesc-grafana
date: 2025-09-25
logsource:
  product: github
  service: audit
detection:
  selection:
    username:
      - "admin0"
      - "admin1"
      - "admin2"
      - "admin3"
      - "admin4"
      - "admin5"
      - "admin6"
      - "admin7"
      - "admin8"
      - "admin9"
      - "admin10"
      - "admin11"
      - "admin12"
      - "admin13"
      - "admin14"
      - "admin15"
      - "admin16"
      - "admin17"
      - "admin18"
      - "admin19"
      - "admin20"
      - "admin21"
      - "admin22"
      - "admin23"
      - "admin24"
      - "admin25"
      - "admin26"
      - "admin27"
      - "admin28"
      - "admin29"
      - "admin30"
      - "admin31"
      - "admin32"
      - "admin33"
      - "admin34"
      - "admin35"
      - "admin36"
      - "admin37"
      - "admin38"
      - "admin39"
      - "admin40"
      - "admin41"
      - "admin42"
      - "admin43"
      - "admin44"
      - "admin45"
      - "admin46"
      - "admin47"
      - "admin48"
      - "admin49"
      - "admin50"
      - "admin51"
      - "admin52"
      - "admin53"
      - "admin54"
      - "admin55"
      - "admin56"
      - "admin57"
      - "admin58"
      - "admin59"
      - "admin60"
      - "admin61"
      - "admin62"
      - "admin63"
      - "admin64"
      - "admin65"
      - "admin66"
      - "admin67"
      - "admin68"
      - "admin69"
      - "admin70"
      - "admin71"
      - "admin72"
      - "admin73"
      - "admin74"
      - "admin75"
      - "admin76"
      - "admin77"
      - "admin78"
      - "admin79"
      - "admin80"
      - "admin81"
      - "admin82"
      - "admin83"
      - "admin84"
      - "admin85"
      - "admin86"
      - "admin87"
      - "admin88"
      - "admin89"
      - "admin90"
      - "admin91"
      - "admin92"
      - "admin93"
      - "admin94"
      - "admin95"
      - "admin96"
      - "admin97"
      - "admin98"
      - "admin99"
      - "admin100"
  condition: selection
falsepositives:
  - Validate the deletion activity is permitted. The "actor" field need to be validated.
level: informational
