title: Test Sigma Rule
id: 7fda29ae-25d2-4a3e-a84e-90ac1de0a508
status: test
description: A Sigma rule created to test conversions
references:
    - https://github.com/SigmaHQ/sigma-specification/blob/main/specification/sigma-rules-specification.md
author: kelnage
date: 2025-04-23
logsource:
    category: testing
detection:
    check:
        field:
            - value1
            - value2
    condition: check
falsepositives:
    - Likely
level: informational
---
title: Test Sigma Correlation Rule
id: 5b2d3e34-c04c-4229-b503-190d5f86f289
author: kelnage
date: 2025-04-23
status: test
correlation:
    type: event_count
    rules:
        - 7fda29ae-25d2-4a3e-a84e-90ac1de0a508
    group-by:
        - field
    timespan: 5m
    condition:
        gte: 10
level: informational
